package wiki.ganhua.hnapay.bean.result.enums;

/**
 * 交易代码
 *
 * @author ganhua
 */
public enum TranCode {

    /**
     * 个人开户接口（新）
     */
    R010,
    /**
     * 用户查询接口
     */
    Q001,
    /**
     * 绑卡接口
     */
    R007,
    /**
     * 绑卡确认接口
     */
    R008,
    /**
     * 个人用户解绑接口
     */
    R009,
    /**
     * 线下入金确认接口
     */
    T004,
    /**
     * 快捷支付下单接口
     */
    T007,
    /**
     * 快捷支付确认接口
     */
    T008,
    /**
     * 收货确认接口
     */
    FOO1,
    /**
     * 提现接口
     */
    T002,
    /**
     * 转账接口
     */
    T003,
    /**
     * 电子回执单接口
     */
    T011
}
